Revit 2027 API
BuiltInFailures.InaccurateFailures.InaccurateBeamOrBrace Property
 Beam or Brace is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InaccurateBeamOrBrace { get; }
Public Shared ReadOnly Property InaccurateBeamOrBrace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InaccurateBeamOrBrace {
	FailureDefinitionId^ get ();
}
static member InaccurateBeamOrBrace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace